---
kind: other
id: Properties.T:Autodesk.Revit.DB.BRepBuilderPersistentIds
source: html/883245d5-7da5-d07a-a1b5-24fdd3117b72.htm
---
# BRepBuilderPersistentIds Properties

Specifies whether the .NET object represents a valid Revit entity.